app/Mixins/Financial/MultiCurrency.php

select * from `currencies` order by `order` asc
---
    public function getCurrencies(): Collection
    {
        if (self::$cachedCurrencies !== null) {
            return self::$cachedCurrencies;
        }

        $defaultCurrency = $this->getDefaultCurrency();
        $currencies = Currency::query()->orderBy('order', 'asc')->get();