app/Models/Api/Webinar.php

            $now = time();
            $webinarIdsHasDiscount = [];

            $tickets = Ticket::where('start_date', '<', $now)
                ->where('end_date', '>', $now)
                ->get();
---
select * from `tickets` where `start_date` < 1790165204 and `end_date` > 1790165204

                    $webinarIdsHasDiscount[] = $ticket->webinar_id;
                }
            }
            $specialOffersWebinarIds = SpecialOffer::where('status', 'active')
                ->where('from_date', '<', $now)
                ->where('to_date', '>', $now)
                ->pluck('webinar_id')
                ->toArray();
---
select `webinar_id` from `special_offers` where `status` = 'active' and `from_date` < 1790165204 and `to_date` > 1790165204