app/Http/Controllers/Api/Config/ConfigController.php

    public function list(Request $request)
    {
        $generalSettings = getGeneralSettings();
        $generalOptionsSettings = getGeneralOptionsSettings();
        $featuresSettings = getFeaturesSettings();
        $financialSettings = getFinancialSettings();
        $financialCurrencySettings = getFinancialCurrencySettings();
        $referralSettings = getReferralSettings();

        $registerMethod = $generalSettings['register_method'] ?? 'mobile';
        $userLanguages = $generalSettings['user_languages'] ?? [];

        if (!empty($userLanguages) and is_array($userLanguages)) {
            $userLanguages = getLanguages($userLanguages);
        } else {
            $userLanguages = [];
        }

        $paymentChannels = PaymentChannel::get()->groupBy('status');
---
select * from `payment_channels`