app/User.php

select * from `meetings` where `disabled` = 0 and `creator_id` = 1015 limit 1
---
    public function hasMeeting()
    {
        $meeting = Meeting::where('disabled', false)
            ->where('creator_id', $this->id)
            ->first();