app/Models/Bundle.php

select sum(`duration`) as aggregate from `bundles` inner join `bundle_webinars` on `bundle_webinars`.`bundle_id` = `bundles`.`id` inner join `webinars` on `webinars`.`id` = `bundle_webinars`.`webinar_id` where `bundles`.`id` = 1
---
    public function getBundleDuration()
    {
        if (empty($this->bundleDuration)) {
            $this->bundleDuration = $this->newQuery()
                ->where('bundles.id', $this->id)
                ->join('bundle_webinars', 'bundle_webinars.bundle_id', 'bundles.id')
                ->join('webinars', 'webinars.id', 'bundle_webinars.webinar_id')
                ->select('bundles.*', DB::raw('sum(webinars.duration) as duration'))
                ->sum('duration');