app/Models/Webinar.php

    public function activeSpecialOffer()
    {
        $time = time();

        if ($this->relationLoaded('specialOffers')) {
            $offer = $this->specialOffers->first(function ($item) use ($time) {
                return $item->status === SpecialOffer::$active
                    && $item->from_date < $time
                    && $item->to_date > $time;
            });
            return $offer ?? false;
        }

        $activeSpecialOffer = SpecialOffer::where('webinar_id', $this->id)
            ->where('status', SpecialOffer::$active)
            ->where('from_date', '<', $time)
            ->where('to_date', '>', $time)
            ->first();
---
select * from `special_offers` where `webinar_id` = 1998 and `status` = 'active' and `from_date` < 1790165204 and `to_date` > 1790165204 limit 1

    public function isProgressing()
    {
        $lastSession = $this->lastSession();
        //$nextSession = $this->nextSession();
        $isProgressing = false;

        if (!empty($lastSession)) {
            $agoraHistory = AgoraHistory::where('session_id', $lastSession->id)
                ->first();
---
select * from `agora_history` where `session_id` = 61 limit 1