app/Http/Controllers/Api/Web/UserController.php

    public function handleProviders(Request $request, $role, $has_meeting = false)
    {
        $query = User::whereIn('role_name', $role)
            //->where('verified', true)
            ->where('users.status', 'active')
            ->where(function ($query) {
                $query->where('users.ban', false)
                    ->orWhere(function ($query) {
                        $query->whereNotNull('users.ban_end_at')
                            ->orWhere('users.ban_end_at', '<', time());
                    });
            });

        if ($has_meeting) {
            $query->whereHas('meeting', function ($query) {
                $query->where('disabled', false);
                $query->whereHas('meetingTimes');
            });
        }

        $users = $this->filterProviders($request, deepClone($query), $role)
            ->get()
            ->map(function ($user) {
                return $user->brief;
            });
---
select * from `users` where `role_name` in ('teacher') and `users`.`status` = 'active' and (`users`.`ban` = 0 or (`users`.`ban_end_at` is not null or `users`.`ban_end_at` < 1790165187))